felias-fogg/dw-link/core-mods/ATTinyCore-mods/boards.txt
attinyx8.name=ATtiny48/88 (No bootloader)
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0xFF
attinyx8.bootloader.lock_bits=0xFF
attinyx8.build.core=tiny
attinyx8.build.export_merged_output=false
attinyx8.menu.LTO.enable=Enabled
attinyx8.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8.menu.LTO.enable.ltocppflags=-flto
attinyx8.menu.LTO.enable.ltoarcmd=gcc-
attinyx8.menu.LTO.disable=Disabled
attinyx8.menu.LTO.disable.ltocflags=
attinyx8.menu.LTO.disable.ltoelfflags=
attinyx8.menu.LTO.disable.ltocppflags=
attinyx8.menu.LTO.disable.ltoarcmd=
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0xff
attinyx8.bootloader.file=empty/empty_all.hex
attinyx8.menu.clock.8internal=8 MHz (internal)
attinyx8.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8.menu.clock.8internal.build.f_cpu=8000000L
attinyx8.menu.clock.8internal.build.clocksource=0
attinyx8.menu.clock.1internal=1 MHz (internal)
attinyx8.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.1internal.build.f_cpu=1000000L
attinyx8.menu.clock.1internal.build.clocksource=0
attinyx8.menu.clock.4internal=4 MHz (internal)
attinyx8.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.4internal.build.f_cpu=4000000L
attinyx8.menu.clock.4internal.build.clocksource=0
attinyx8.menu.clock.128internal=128 kHz (internal WDT)
attinyx8.menu.clock.128internal.bootloader.low_fuses=0xC3
attinyx8.menu.clock.128internal.build.f_cpu=128000L
attinyx8.menu.clock.128external.build.clocksource=3
attinyx8.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.8external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.8external.build.f_cpu=8000000L
attinyx8.menu.clock.8external.build.clocksource=2
attinyx8.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.12external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.12external.build.f_cpu=12000000L
attinyx8.menu.clock.12external.build.clocksource=2
attinyx8.menu.clock.16external=16 MHz (external CLOCK, overclocked - Danger: see docs!)
attinyx8.menu.clock.16external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.16external.build.f_cpu=16000000L
attinyx8.menu.clock.16external.build.clocksource=2
attinyx8.menu.pinmapping.normal=Standard
attinyx8.menu.pinmapping.normal.build.variant=tinyX8
attinyx8.menu.pinmapping.mhtiny=MH Tiny
attinyx8.menu.pinmapping.mhtiny.build.variant=tinyX8_MH
attinyx8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8.menu.eesave.aenable=EEPROM retained
attinyx8.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx8.menu.eesave.disable=EEPROM not retained
attinyx8.menu.eesave.disable.bootloader.eesave_bit=1
attinyx8.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8.menu.bod.disable.bootloader.bod_bits=111
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.bod_bits=110
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.bod_bits=101
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.bod_bits=100
attinyx8.build.variant=tinyX8
attinyx8.menu.millis.enabled=Enabled
attinyx8.menu.millis.disabled=Disabled (saves flash)
attinyx8.menu.millis.enabled.build.millis=
attinyx8.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8.build.extra_flags={build.millis} {build.neopixelport}


attinyx8opti.name=ATtiny48/88 (Optiboot)
attinyx8opti.upload.tool=avrdude
attinyx8opti.upload.protocol=arduino
attinyx8opti.upload.speed=19200
attinyx8opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.postfix}.hex
attinyx8opti.bootloader.postfix=
attinyx8opti.build.board=AVR_ATTINYX8
attinyx8opti.bootloader.tool=avrdude
attinyx8opti.bootloader.unlock_bits=0xFF
attinyx8opti.bootloader.lock_bits=0xFF
attinyx8opti.build.core=tiny
attinyx8opti.build.export_merged_output=false
attinyx8opti.menu.LTO.enable=Enabled
attinyx8opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8opti.menu.LTO.enable.ltocppflags=-flto
attinyx8opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx8opti.menu.LTO.disable=Disabled
attinyx8opti.menu.LTO.disable.ltocflags=
attinyx8opti.menu.LTO.disable.ltoelfflags=
attinyx8opti.menu.LTO.disable.ltocppflags=
attinyx8opti.menu.LTO.disable.ltoarcmd=
attinyx8opti.menu.chip.88=ATtiny88
attinyx8opti.menu.chip.88.build.mcu=attiny88
attinyx8opti.menu.chip.88.upload.maximum_size=7552
attinyx8opti.menu.chip.88.upload.maximum_data_size=512
attinyx8opti.menu.chip.48=ATtiny48
attinyx8opti.menu.chip.48.build.mcu=attiny48
attinyx8opti.menu.chip.48.upload.maximum_size=3456
attinyx8opti.menu.chip.48.upload.maximum_data_size=256
attinyx8opti.menu.clock.8internal=8 MHz (internal)
attinyx8opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx8opti.menu.clock.8internal.build.clocksource=0
attinyx8opti.menu.clock.4internal=4 MHz (internal)
attinyx8opti.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.4internal.build.f_cpu=4000000L
attinyx8opti.menu.clock.4internal.bootloader.postfix=_int
attinyx8opti.menu.clock.4internal.build.clocksource=0
attinyx8opti.menu.clock.1internal=1 MHz (internal)
attinyx8opti.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.1internal.build.f_cpu=1000000L
attinyx8opti.menu.clock.1internal.build.clocksource=0
attinyx8opti.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attinyx8opti.menu.clock.8external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.8external.build.f_cpu=8000000L
attinyx8opti.menu.clock.8external.build.clocksource=2
attinyx8opti.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attinyx8opti.menu.clock.12external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.12external.build.f_cpu=12000000L
attinyx8opti.menu.clock.16external.build.clocksource=2
attinyx8opti.menu.clock.16external=16 MHz (external CLOCK, overclocked - Danger: see docs!)
attinyx8opti.menu.clock.16external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.16external.build.f_cpu=16000000L
attinyx8opti.menu.clock.16external.build.clocksource=2
attinyx8opti.menu.pinmapping.normal=Standard
attinyx8opti.menu.pinmapping.normal.build.variant=tinyX8
attinyx8opti.menu.pinmapping.mhtiny=MH Tiny
attinyx8opti.menu.pinmapping.mhtiny.build.variant=tinyX8_MH
attinyx8opti.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attinyx8opti.bootloader.extended_fuses=0xfe
attinyx8opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8opti.menu.bod.disable.bootloader.bod_bits=111
attinyx8opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx8opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx8opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx8opti.build.variant=tinyX8
attinyx8opti.menu.millis.enabled=Enabled
attinyx8opti.menu.millis.disabled=Disabled (saves flash)
attinyx8opti.menu.millis.enabled.build.millis=
attinyx8opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8opti.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8opti.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8opti.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8opti.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8opti.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8opti.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8opti.build.extra_flags={build.millis} {build.neopixelport}


attinyx8micr.name=ATtiny88 (Micronucleus, MH-ET t88 w/16MHz CLOCK)
attinyx8micr.upload.tool=micronucleus
attinyx8micr.upload.protocol=usb
attinyx8micr.build.board=AVR_ATTINYX8
attinyx8micr.bootloader.tool=avrdude
attinyx8micr.bootloader.unlock_bits=0xFF
attinyx8micr.bootloader.lock_bits=0xFF
attinyx8micr.build.core=tiny
attinyx8micr.build.export_merged_output=false
attinyx8micr.menu.LTO.enable=Enabled
attinyx8micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8micr.menu.LTO.enable.ltocppflags=-flto
attinyx8micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx8micr.menu.LTO.disable=Disabled
attinyx8micr.menu.LTO.disable.ltocflags=
attinyx8micr.menu.LTO.disable.ltoelfflags=
attinyx8micr.menu.LTO.disable.ltocppflags=
attinyx8micr.menu.LTO.disable.ltoarcmd=
attinyx8micr.bootloader.low_fuses=0xE0
attinyx8micr.build.mcu=attiny88
attinyx8micr.build.usb=
attinyx8micr.upload.maximum_size=6780
attinyx8micr.upload.maximum_data_size=512
#attinyx8micr.menu.micrclock.16extclock=External CLOCK 16 MHz
attinyx8micr.menu.sketchclock.16external=16 MHz (external 16MHz, USB)
attinyx8micr.menu.sketchclock.16external.build.usb=-DHASUSB
attinyx8micr.menu.sketchclock.16external.build.f_cpu=16000000L
attinyx8micr.menu.sketchclock.16external.build.clocksource=18
attinyx8micr.menu.sketchclock.8external16=8 MHz (external 16MHz, no USB)
attinyx8micr.menu.sketchclock.8external16.build.f_cpu=8000000L
attinyx8micr.menu.sketchclock.8external16.build.clocksource=18
attinyx8micr.menu.sketchclock.4external16=4 MHz (external 16MHz, no USB)
attinyx8micr.menu.sketchclock.4external16.build.f_cpu=4000000L
attinyx8micr.menu.sketchclock.4external16.build.clocksource=18
attinyx8micr.menu.sketchclock.1external16=1 MHz (external 16MHz, no USB)
attinyx8micr.menu.sketchclock.1external16.build.f_cpu=1000000L
attinyx8micr.menu.sketchclock.1external16.build.clocksource=18
attinyx8micr.menu.pinmapping.mhtiny=MH Tiny
attinyx8micr.menu.pinmapping.mhtiny.build.variant=tinyX8_MH
attinyx8micr.menu.pinmapping.normal=ATTinyCore Standard
attinyx8micr.menu.pinmapping.normal.build.variant=tinyX8
attinyx8micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx8micr.bootloader.extended_fuses=0xfe
attinyx8micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8micr.menu.bod.4v3.bootloader.bod_bits=100
attinyx8micr.menu.bod.2v7=B.O.D. Enabled (2.7v, out of spec)
attinyx8micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx8micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8micr.menu.bod.disable.bootloader.bod_bits=111
attinyx8micr.menu.resetpin.reset=Reset
attinyx8micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx8micr.menu.resetpin.gpio=GPIO (Danger - disables ISP)
attinyx8micr.menu.resetpin.gpio.bootloader.rstbit=0
attinyx8micr.menu.burnmode.upgrade=Upgrade (via USB, fuses unchanged)
attinyx8micr.menu.burnmode.upgrade.bootloader.file=micronucleus/upgrade-{bootloader.entryversion}
attinyx8micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx8micr.menu.burnmode.install=Fresh Install (via ISP, set fuses)
attinyx8micr.menu.burnmode.install.bootloader.file=micronucleus/{bootloader.entryversion}
attinyx8micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx8micr.menu.bootentry.always=Always
attinyx8micr.menu.bootentry.safereset=After Ext Reset (see docs if rstdisbl set)
attinyx8micr.menu.bootentry.fastpoweron=After Power On
attinyx8micr.menu.bootentry.saferesetwdt=Ext. Reset or WDT
attinyx8micr.menu.bootentry.fastpoweronwdt=Power On or WDT
attinyx8micr.menu.bootentry.notwdt=Anything except WDT
attinyx8micr.menu.bootentry.aggressive=Always w/unsafe opts (64b more space)
attinyx8micr.menu.bootentry.always.bootloader.entryversion=t88_always.hex
attinyx8micr.menu.bootentry.safereset.bootloader.entryversion=t88_safereset.hex
attinyx8micr.menu.bootentry.fastpoweron.bootloader.entryversion=t88_fastpoweron.hex
attinyx8micr.menu.bootentry.saferesetwdt.bootloader.entryversion=t88_saferesetwdt.hex
attinyx8micr.menu.bootentry.fastpoweronwdt.bootloader.entryversion=t88_fastpoweronwdt.hex
attinyx8micr.menu.bootentry.notwdt.bootloader.entryversion=t88_notwdt.hex
attinyx8micr.menu.bootentry.aggressive.bootloader.entryversion=t88_aggressive.hex
attinyx8micr.menu.bootentry.aggressive.upload.maximum_size=6844
attinyx8micr.build.variant=tinyX8_MH
attinyx8micr.menu.millis.enabled=Enabled
attinyx8micr.menu.millis.disabled=Disabled (saves flash)
attinyx8micr.menu.millis.enabled.build.millis=
attinyx8micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8micr.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8micr.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8micr.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8micr.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8micr.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8micr.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8micr.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8micr.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8micr.build.extra_flags={build.millis} {build.usb} {build.neopixelport}


