felias-fogg/dw-link/core-mods/ATTinyCore-mods/boards.txt
attinyx41micr.name=ATtiny841 (Micronucleus / Wattuino)
attinyx41micr.bootloader.rstbit=1
attinyx41micr.upload.protocol=usb
attinyx41micr.upload.maximum_size=6586
attinyx41micr.upload.maximum_data_size=512
attinyx41micr.upload.tool=micronucleus
attinyx41micr.bootloader.tool=avrdude
attinyx41micr.bootloader.unlock_bits=0xFF
attinyx41micr.bootloader.lock_bits=0xFF
attinyx41micr.build.mcu=attiny841
attinyx41micr.build.core=tinymodern
attinyx41micr.build.board=AVR_ATTINYX41
attinyx41micr.build.speedfix=
attinyx41micr.build.usb=
attinyx41micr.build.export_merged_output=false
attinyx41micr.bootloader.extended_fuses=0xFE
attinyx41micr.bootloader.high_fuses=0xD7
attinyx41micr.menu.LTO.enable=Enabled
attinyx41micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx41micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx41micr.menu.LTO.enable.ltocppflags=-flto
attinyx41micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx41micr.menu.LTO.disable=Disabled
attinyx41micr.menu.LTO.disable.ltocflags=
attinyx41micr.menu.LTO.disable.ltoelfflags=
attinyx41micr.menu.LTO.disable.ltocppflags=
attinyx41micr.menu.LTO.disable.ltoarcmd=
attinyx41micr.bootloader.low_fuses=0xE2
attinyx41micr.build.f_cpu=8000000L
attinyx41micr.build.clocksource=0
attinyx41micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx41micr.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41micr.menu.clock.internal=Internal w/tuning from USB
attinyx41micr.menu.sketchclock.8internal5v=8 MHz (internal, Vcc > 4.5V)
attinyx41micr.menu.sketchclock.8internal5v.build.f_cpu=8000000L
attinyx41micr.menu.sketchclock.8internal5v.build.clocksource=0
attinyx41micr.menu.sketchclock.8internal5v.build.speedfix=-DLOWERCAL=6
attinyx41micr.menu.sketchclock.8internal=8 MHz (internal, Vcc < 4.5V)
attinyx41micr.menu.sketchclock.8internal.build.f_cpu=8000000L
attinyx41micr.menu.sketchclock.8internal.build.clocksource=0
attinyx41micr.menu.sketchclock.16internal=16 MHz (internal, Vcc > 4.5V warning - see docs!)
attinyx41micr.menu.sketchclock.16internal.build.f_cpu=16000000L
attinyx41micr.menu.sketchclock.16internal.build.clocksource=0
attinyx41micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41micr.menu.bod.4v3.bootloader.bod_bits=100
attinyx41micr.menu.bod.2v7=B.O.D. Enabled (2.7v - out of spec)
attinyx41micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx41micr.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41micr.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41micr.menu.bodact.enabled=B.O.D. Enabled
attinyx41micr.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41micr.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41micr.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41micr.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41micr.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41micr.menu.bodpd.enabled=B.O.D. Enabled
attinyx41micr.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41micr.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41micr.menu.bodpd.sampled.bootloader.bodpd_bits=01
attinyx41micr.menu.pinmapping.anew=Clockwise (like Nanite, recommended)
attinyx41micr.menu.pinmapping.anew.build.pinmap=-DNEW_PINOUT
attinyx41micr.menu.pinmapping.old=Counterclockwise (like old ATTinyCore)
attinyx41micr.menu.pinmapping.old.build.pinmap=-DOLD_PINOUT
attinyx41micr.menu.wiremode.amaster=Master Only
attinyx41micr.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41micr.menu.wiremode.slave=Slave Only
attinyx41micr.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41micr.menu.wiremode.both=Both (uses more flash)
attinyx41micr.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41micr.menu.millis.enabled=Enabled
attinyx41micr.menu.millis.disabled=Disabled (saves flash)
attinyx41micr.menu.millis.enabled.build.millis=
attinyx41micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41micr.menu.neopixelport.porta=Port A (CW:0~7,CCW:3~10)
attinyx41micr.menu.neopixelport.portb=Port B (CW:8~11,CCW:0~2,11)
attinyx41micr.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx41micr.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
#attinyx41micr.menu.resetpin.reset=Reset
#attinyx41micr.menu.resetpin.reset.bootloader.rstbit=1
#attinyx41micr.menu.resetpin.gpio=GPIO (Danger - disables ISP)
#attinyx41micr.menu.resetpin.gpio.bootloader.rstbit=0
attinyx41micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx41micr.menu.burnmode.upgrade.bootloader.file=micronucleus/upgrade-Nanite841.hex
attinyx41micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx41micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx41micr.menu.burnmode.install.bootloader.file=micronucleus/Nanite841.hex
attinyx41micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx41micr.build.extra_flags={build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.usb} {build.speedfix}


attiny43.name=ATtiny43 (No bootloader)
attiny43.upload.maximum_size=4096
attiny43.upload.maximum_data_size=256
attiny43.upload.tool=avrdude
attiny43.bootloader.tool=avrdude
attiny43.bootloader.unlock_bits=0x3F
attiny43.bootloader.lock_bits=0x3F
attiny43.build.mcu=attiny43u
attiny43.build.core=tiny
attiny43.build.variant=tiny43
attiny43.build.board=AVR_ATTINY43
attiny43.bootloader.file=empty/empty_all.hex
attiny43.build.export_merged_output=false
attiny43.menu.LTO.enable=Enabled
attiny43.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attiny43.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attiny43.menu.LTO.enable.ltocppflags=-flto
attiny43.menu.LTO.enable.ltoarcmd=gcc-
attiny43.menu.LTO.disable=Disabled
attiny43.menu.LTO.disable.ltocflags=
attiny43.menu.LTO.disable.ltoelfflags=
attiny43.menu.LTO.disable.ltocppflags=
attiny43.menu.LTO.disable.ltoarcmd=
attiny43.bootloader.extended_fuses=0x01
attiny43.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny43.menu.eesave.aenable=EEPROM retained
attiny43.menu.eesave.aenable.bootloader.eesave_bit=0
attiny43.menu.eesave.disable=EEPROM not retained
attiny43.menu.eesave.disable.bootloader.eesave_bit=1
attiny43.menu.bod.disable=B.O.D. Disabled (saves power)
attiny43.menu.bod.disable.bootloader.bod_bits=111
attiny43.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny43.menu.bod.1v8.bootloader.bod_bits=110
attiny43.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny43.menu.bod.2v7.bootloader.bod_bits=101
attiny43.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny43.menu.bod.4v3.bootloader.bod_bits=100
attiny43.menu.clock.8internal=8 MHz (internal)
attiny43.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny43.menu.clock.8internal.build.f_cpu=8000000L
attiny43.menu.clock.8internal.build.clocksource=0
attiny43.menu.clock.4internal=4 MHz (internal)
attiny43.menu.clock.4internal.bootloader.low_fuses=0x62
attiny43.menu.clock.4internal.build.f_cpu=4000000L
attiny43.menu.clock.4internal.build.clocksource=0
attiny43.menu.clock.1internal=1 MHz (internal)
attiny43.menu.clock.1internal.bootloader.low_fuses=0x62
attiny43.menu.clock.1internal.build.f_cpu=1000000L
attiny43.menu.clock.1internal.build.clocksource=0
attiny43.menu.clock.128internal=128 kHz (internal WDT)
attiny43.menu.clock.128internal.bootloader.low_fuses=0xC3
attiny43.menu.clock.128internal.build.f_cpu=128000L
attiny43.menu.clock.128internal.build.clocksource=3
attiny43.menu.millis.enabled=Enabled
attiny43.menu.millis.disabled=Disabled (saves flash)
attiny43.menu.millis.enabled.build.millis=
attiny43.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny43.menu.neopixelport.porta=Port A (pins 8~15)
attiny43.menu.neopixelport.portb=Port B (pins 0~7)
attiny43.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attiny43.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attiny43.build.extra_flags={build.millis} {build.neopixelport}

attiny828.name=ATtiny828 (No bootloader)
attiny828.upload.maximum_size=8192
attiny828.upload.maximum_data_size=512
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.bootloader.unlock_bits=0x3F
attiny828.bootloader.lock_bits=0x3F
attiny828.build.mcu=attiny828
attiny828.build.core=tinymodern
attiny828.build.board=AVR_ATTINY828
attiny828.build.speedfix=
attiny828.build.export_merged_output=false
attiny828.menu.LTO.enable=Enabled
attiny828.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attiny828.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attiny828.menu.LTO.enable.ltocppflags=-flto
attiny828.menu.LTO.enable.ltoarcmd=gcc-
attiny828.menu.LTO.disable=Disabled
attiny828.menu.LTO.disable.ltocflags=
attiny828.menu.LTO.disable.ltoelfflags=
attiny828.menu.LTO.disable.ltocppflags=
attiny828.menu.LTO.disable.ltoarcmd=
attiny828.bootloader.file=empty/empty_all.hex
attiny828.menu.clock.8internal5v=8 MHz (internal, Vcc > 4.5V)
attiny828.menu.clock.8internal5v.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal5v.build.f_cpu=8000000L
attiny828.menu.clock.8internal5v.build.speedfix=-DLOWERCAL=9
attiny828.menu.clock.8internal5v.build.clocksource=0
attiny828.menu.clock.8internal=8 MHz (internal, Vcc < 4.5V)
attiny828.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828.menu.clock.8internal.build.f_cpu=8000000L
attiny828.menu.clock.8internal.build.clocksource=0
attiny828.menu.clock.4internal5v=4 MHz (internal, Vcc > 4.5V)
attiny828.menu.clock.4internal5v.bootloader.low_fuses=0x6E
attiny828.menu.clock.4internal5v.build.f_cpu=4000000L
attiny828.menu.clock.4internal5v.build.speedfix=-DLOWERCAL=9
attiny828.menu.clock.4internal5v.build.clocksource=0
attiny828.menu.clock.4internal=4 MHz (internal, Vcc < 4.5V)
attiny828.menu.clock.4internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.4internal.build.f_cpu=4000000L
attiny828.menu.clock.4internal.build.clocksource=0
attiny828.menu.clock.1internal5v=1 MHz (internal, Vcc > 4.5V)
attiny828.menu.clock.1internal5v.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal5v.build.f_cpu=1000000L
attiny828.menu.clock.1internal5v.build.speedfix=-DLOWERCAL=9
attiny828.menu.clock.1internal5v.build.clocksource=0
attiny828.menu.clock.1internal=1 MHz (internal, Vcc < 4.5V)
attiny828.menu.clock.1internal.bootloader.low_fuses=0x6E
attiny828.menu.clock.1internal.build.f_cpu=1000000L
attiny828.menu.clock.1internal.build.clocksource=0
attiny828.menu.clock.32internal=32 kHz (internal ULP)
attiny828.menu.clock.32internal.bootloader.low_fuses=0xC3
attiny828.menu.clock.32internal.build.f_cpu=32000L
attiny828.menu.clock.32internal.build.clocksource=4
attiny828.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attiny828.menu.clock.8external.bootloader.low_fuses=0xE0
attiny828.menu.clock.8external.build.f_cpu=8000000L
attiny828.menu.clock.8external.build.clocksource=2
attiny828.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attiny828.menu.clock.12external.bootloader.low_fuses=0xE0
attiny828.menu.clock.12external.build.f_cpu=12000000L
attiny828.menu.clock.12external.build.clocksource=2
attiny828.menu.clock.16external=16 MHz (external CLOCK - Danger: see docs!)
attiny828.menu.clock.16external.bootloader.low_fuses=0xE0
attiny828.menu.clock.16external.build.f_cpu=16000000L
attiny828.menu.clock.16external.build.clocksource=2
attiny828.menu.clock.20external=20 MHz (external CLOCK - Danger: see docs!)
attiny828.menu.clock.20external.bootloader.low_fuses=0xE0
attiny828.menu.clock.20external.build.f_cpu=20000000L
attiny828.menu.clock.20external.build.clocksource=2
attiny828.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny828.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1111
attiny828.menu.eesave.aenable=EEPROM retained
attiny828.menu.eesave.aenable.bootloader.eesave_bit=0
attiny828.menu.eesave.disable=EEPROM not retained
attiny828.menu.eesave.disable.bootloader.eesave_bit=1
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.bod_bits=110
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.bod_bits=101
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.bod_bits=100
attiny828.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny828.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828.menu.bodact.enabled=B.O.D. Enabled
attiny828.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny828.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828.menu.bodpd.enabled=B.O.D. Enabled
attiny828.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828.menu.bodpd.sampled.bootloader.bodpd_bits=01
attiny828.menu.wiremode.amaster=Master Only
attiny828.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attiny828.menu.wiremode.slave=Slave Only
attiny828.menu.wiremode.slave.build.extra_flags=-DWIRE_SLAVE_ONLY
attiny828.menu.wiremode.both=Both (uses more flash)
attiny828.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attiny828.menu.millis.enabled=Enabled
attiny828.menu.millis.disabled=Disabled (saves flash)
attiny828.menu.millis.enabled.build.millis=
attiny828.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny828.menu.neopixelport.porta=Port A (pins 0~7)
attiny828.menu.neopixelport.portb=Port B (pins 8~15)
attiny828.menu.neopixelport.portc=Port C (pins 16~23)
attiny828.menu.neopixelport.portd=Port D (pins 24~27)
attiny828.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attiny828.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attiny828.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attiny828.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attiny828.build.extra_flags={build.millis} {build.neopixelport} {build.wiremode} {build.speedfix}


