felias-fogg/dw-link/core-mods/ATTinyCore-mods/boards.txt
attiny828opti.name=ATtiny828 (Optiboot)
attiny828opti.upload.maximum_size=7680
attiny828opti.upload.maximum_data_size=512
attiny828opti.upload.protocol=arduino
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.unlock_bits=0x3F
attiny828opti.bootloader.lock_bits=0x3F
attiny828opti.bootloader.int5v=
attiny828opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.int5v}.hex
attiny828opti.build.mcu=attiny828
attiny828opti.build.core=tinymodern
attiny828opti.build.board=AVR_ATTINY828
attiny828opti.build.speedfix=
attiny828opti.build.export_merged_output=true
attiny828opti.bootloader.low_fuses=0xEE
attiny828opti.menu.LTO.enable=Enabled
attiny828opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attiny828opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attiny828opti.menu.LTO.enable.ltocppflags=-flto
attiny828opti.menu.LTO.enable.ltoarcmd=gcc-
attiny828opti.menu.LTO.disable=Disabled
attiny828opti.menu.LTO.disable.ltocflags=
attiny828opti.menu.LTO.disable.ltoelfflags=
attiny828opti.menu.LTO.disable.ltocppflags=
attiny828opti.menu.LTO.disable.ltoarcmd=
attiny828opti.menu.clock.8internal5v=8 MHz (internal, Vcc > 4.5V)
attiny828opti.menu.clock.8internal5v.bootloader.low_fuses=0xEE
attiny828opti.menu.clock.8internal5v.bootloader.int5v=_int
attiny828opti.menu.clock.8internal5v.build.speedfix=-DLOWERCAL=9
attiny828opti.menu.clock.8internal5v.build.f_cpu=8000000L
attiny828opti.menu.clock.8internal5v.upload.speed=57600
attiny828opti.menu.clock.8internal5v.build.clocksource=0
attiny828opti.menu.clock.8internal=8 MHz (internal, Vcc < 4.5V)
attiny828opti.menu.clock.8internal.bootloader.low_fuses=0xEE
attiny828opti.menu.clock.8internal.bootloader.int5v=_int
attiny828opti.menu.clock.8internal.build.f_cpu=8000000L
attiny828opti.menu.clock.8internal.upload.speed=57600
attiny828opti.menu.clock.8internal.build.clocksource=0
attiny828opti.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attiny828opti.menu.clock.8external.bootloader.low_fuses=0xE0
attiny828opti.menu.clock.8external.build.f_cpu=8000000L
attiny828opti.menu.clock.8external.upload.speed=57600
attiny828opti.menu.clock.8external.build.clocksource=2
attiny828opti.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attiny828opti.menu.clock.12external.bootloader.low_fuses=0xE0
attiny828opti.menu.clock.12external.build.f_cpu=12000000L
attiny828opti.menu.clock.12external.upload.speed=115200
attiny828opti.menu.clock.12external.build.clocksource=2
attiny828opti.menu.clock.16external=16 MHz (external CLOCK - Danger: see docs!)
attiny828opti.menu.clock.16external.bootloader.low_fuses=0xE0
attiny828opti.menu.clock.16external.build.f_cpu=16000000L
attiny828opti.menu.clock.16external.upload.speed=115200
attiny828opti.menu.clock.16external.build.clocksource=2
attiny828opti.menu.clock.20external=20 MHz (external CLOCK - Danger: see docs!)
attiny828opti.menu.clock.20external.bootloader.low_fuses=0xE0
attiny828opti.menu.clock.20external.build.f_cpu=20000000L
attiny828opti.menu.clock.20external.upload.speed=115200
attiny828opti.menu.clock.20external.build.clocksource=2
attiny828opti.menu.clock.1internal5v=1 MHz (internal, Vcc > 4.5V)
attiny828opti.menu.clock.1internal5v.bootloader.low_fuses=0xEE
attiny828opti.menu.clock.1internal5v.bootloader.int5v=_int
attiny828opti.menu.clock.1internal5v.build.speedfix=-DLOWERCAL=9
attiny828opti.menu.clock.1internal5v.build.f_cpu=8000000L
attiny828opti.menu.clock.1internal5v.upload.speed=4800
attiny828opti.menu.clock.1internal5v.build.clocksource=0
attiny828opti.menu.clock.1internal=1 MHz (internal, Vcc < 4.5V)
attiny828opti.menu.clock.1internal.bootloader.low_fuses=0xEE
attiny828opti.menu.clock.1internal.bootloader.int5v=_int
attiny828opti.menu.clock.1internal.build.f_cpu=8000000L
attiny828opti.menu.clock.1internal.upload.speed=4800
attiny828opti.menu.clock.1internal.build.clocksource=0
attiny828opti.bootloader.high_fuses=0b11010{bootloader.bod_bits}
attiny828opti.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1010
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.bod_bits=110
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.bod_bits=101
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.bod_bits=100
attiny828opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny828opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828opti.menu.bodact.enabled=B.O.D. Enabled
attiny828opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny828opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828opti.menu.bodpd.enabled=B.O.D. Enabled
attiny828opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodpd.sampled.bootloader.bodpd_bits=01
attiny828opti.menu.wiremode.amaster=Master Only
attiny828opti.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
attiny828opti.menu.wiremode.slave=Slave Only
attiny828opti.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attiny828opti.menu.wiremode.both=Both (uses more flash)
attiny828opti.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attiny828opti.menu.millis.enabled=Enabled
attiny828opti.menu.millis.disabled=Disabled (saves flash)
attiny828opti.menu.millis.enabled.build.millis=
attiny828opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny828opti.menu.neopixelport.porta=Port A (pins 0~7)
attiny828opti.menu.neopixelport.portb=Port B (pins 8~15)
attiny828opti.menu.neopixelport.portc=Port C (pins 16~23)
attiny828opti.menu.neopixelport.portd=Port D (pins 24~27)
attiny828opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attiny828opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attiny828opti.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attiny828opti.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attiny828opti.build.extra_flags={build.millis} {build.neopixelport} {build.wiremode} {build.speedfix}



attiny1634.name=ATtiny1634 (No bootloader)
attiny1634.upload.maximum_size=16384
attiny1634.upload.maximum_data_size=1024
attiny1634.upload.tool=avrdude
attiny1634.bootloader.tool=avrdude
attiny1634.bootloader.unlock_bits=0xFF
attiny1634.bootloader.lock_bits=0xFF
attiny1634.bootloader.file=empty/empty_all.hex
attiny1634.build.mcu=attiny1634
attiny1634.build.core=tinymodern
attiny1634.build.board=AVR_ATTINY1634
attiny1634.build.speedfix=
attiny1634.build.export_merged_output=false
attiny1634.bootloader.extended_fuses=0xFF
attiny1634.bootloader.high_fuses=0xD7
attiny1634.menu.LTO.enable=Enabled
attiny1634.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attiny1634.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attiny1634.menu.LTO.enable.ltocppflags=-flto
attiny1634.menu.LTO.enable.ltoarcmd=gcc-
attiny1634.menu.LTO.disable=Disabled
attiny1634.menu.LTO.disable.ltocflags=
attiny1634.menu.LTO.disable.ltoelfflags=
attiny1634.menu.LTO.disable.ltocppflags=
attiny1634.menu.LTO.disable.ltoarcmd=
attiny1634.menu.clock.8internal5v=8 MHz (internal Vcc > 4.5V)
attiny1634.menu.clock.8internal5v.bootloader.low_fuses=0xE2
attiny1634.menu.clock.8internal5v.build.f_cpu=8000000L
attiny1634.menu.clock.8internal5v.build.speedfix=-DLOWERCAL=9
attiny1634.menu.clock.8internal5v.build.clocksource=0
attiny1634.menu.clock.8internal=8 MHz (internal Vcc < 4.5V)
attiny1634.menu.clock.8internal.bootloader.low_fuses=0xE2
attiny1634.menu.clock.8internal.build.f_cpu=8000000L
attiny1634.menu.clock.8internal.build.clocksource=0
attiny1634.menu.clock.12external=12 MHz (external)
attiny1634.menu.clock.12external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.12external.build.f_cpu=12000000L
attiny1634.menu.clock.12external.build.clocksource=1
attiny1634.menu.clock.8external=8 MHz (external)
attiny1634.menu.clock.8external.bootloader.low_fuses=0xED
attiny1634.menu.clock.8external.build.f_cpu=8000000L
attiny1634.menu.clock.8external.build.clocksource=1
attiny1634.menu.clock.737external=7.372 MHz (external)
attiny1634.menu.clock.737external.bootloader.low_fuses=0xED
attiny1634.menu.clock.737external.build.f_cpu=7372800L
attiny1634.menu.clock.737external.build.clocksource=1
attiny1634.menu.clock.92external=9.216 MHz (external)
attiny1634.menu.clock.92external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.92external.build.f_cpu=9216000L
attiny1634.menu.clock.92external.build.clocksource=1
attiny1634.menu.clock.11external=11.0592 MHz (external)
attiny1634.menu.clock.11external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.11external.build.f_cpu=11059200L
attiny1634.menu.clock.11external.build.clocksource=1
attiny1634.menu.clock.143external=14.7456 MHz (external - overclocked)
attiny1634.menu.clock.143external.bootloader.low_fuses=0xEE
attiny1634.menu.clock.143external.build.f_cpu=14745600L
attiny1634.menu.clock.143external.build.clocksource=1
attiny1634.menu.clock.6external=6 MHz (external)
attiny1634.menu.clock.6external.bootloader.low_fuses=0xED
attiny1634.menu.clock.6external.build.f_cpu=6000000L
attiny1634.menu.clock.6external.build.clocksource=1
attiny1634.menu.clock.4external=4 MHz (external)
attiny1634.menu.clock.4external.bootloader.low_fuses=0xED
attiny1634.menu.clock.4external.build.f_cpu=4000000L
attiny1634.menu.clock.4external.build.clocksource=1
attiny1634.menu.clock.4internal=4 MHz (internal)
attiny1634.menu.clock.4internal.bootloader.low_fuses=0x62
attiny1634.menu.clock.4internal.build.f_cpu=4000000L
attiny1634.menu.clock.4internal.build.clocksource=0
attiny1634.menu.clock.1internal=1 MHz (internal)
attiny1634.menu.clock.1internal.bootloader.low_fuses=0x62
attiny1634.menu.clock.1internal.build.f_cpu=1000000L
attiny1634.menu.clock.1internal.build.clocksource=0
attiny1634.menu.clock.16external=16 MHz (external - overclocked)
attiny1634.menu.clock.16external.bootloader.low_fuses=0xEF
attiny1634.menu.clock.16external.build.f_cpu=16000000L
attiny1634.menu.clock.16external.build.clocksource=1
attiny1634.menu.clock.32internal=32 kHz (internal ULP)
attiny1634.menu.clock.32internal.bootloader.low_fuses=0xC3
attiny1634.menu.clock.32internal.build.f_cpu=32000L
attiny1634.menu.clock.32internal.build.clocksource=4
attiny1634.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny1634.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634.menu.eesave.aenable=EEPROM retained
attiny1634.menu.eesave.aenable.bootloader.eesave_bit=0
attiny1634.menu.eesave.disable=EEPROM not retained
attiny1634.menu.eesave.disable.bootloader.eesave_bit=1
attiny1634.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634.menu.bod.1v8.bootloader.bod_bits=110
attiny1634.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634.menu.bod.2v7.bootloader.bod_bits=101
attiny1634.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634.menu.bod.4v3.bootloader.bod_bits=100
attiny1634.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634.menu.bodact.enabled=B.O.D. Enabled
attiny1634.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634.menu.bodpd.enabled=B.O.D. Enabled
attiny1634.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634.menu.bodpd.sampled.bootloader.bodpd_bits=01
attiny1634.menu.millis.enabled=Enabled
attiny1634.menu.millis.disabled=Disabled (saves flash)
attiny1634.menu.millis.enabled.build.millis=
attiny1634.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634.menu.neopixelport.porta=Port A (pins 1~8)
attiny1634.menu.neopixelport.portb=Port B (pins 0,14,15,16)
attiny1634.menu.neopixelport.portc=Port C (pins 9~13, 17)
attiny1634.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attiny1634.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attiny1634.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attiny1634.build.extra_flags={build.millis} {build.neopixelport} {build.speedfix}

