felias-fogg/dw-link/core-mods/ATTinyCore-mods/boards.txt
attinyx5opti.menu.debug.os=No Debug
attinyx5opti.menu.debug.os.build.debug=
attinyx5opti.menu.debug.og=Debug
attinyx5opti.menu.debug.og.build.debug=-Og
attinyx5opti.menu.debug.o0=Debug (no comp. optim.)
attinyx5opti.menu.debug.o0.build.debug=-O0
attinyx5opti.menu.debug.no-lto=Debug (no LTO)
attinyx5opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx5opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx5opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx5opti.build.extra_flags={build.debug} {build.millis} -DNEOPIXELPORT=PORTB {build.pllsettings}

attinyx5micr.menu.debug.os=No Debug
attinyx5micr.menu.debug.os.build.debug=
attinyx5micr.menu.debug.og=Debug
attinyx5micr.menu.debug.og.build.debug=-Og
attinyx5micr.menu.debug.o0=Debug (no comp. optim.)
attinyx5micr.menu.debug.o0.build.debug=-O0
attinyx5micr.menu.debug.no-lto=Debug (no LTO)
attinyx5micr.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx5micr.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx5micr.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx5micr.build.extra_flags={build.debug} {build.millis} -DNEOPIXELPORT=PORTB {build.pllsettings} {build.usb} -DBOOTTUNED165

attinyx8.menu.debug.os=No Debug
attinyx8.menu.debug.os.build.debug=
attinyx8.menu.debug.og=Debug
attinyx8.menu.debug.og.build.debug=-Og
attinyx8.menu.debug.o0=Debug (no comp. optim.)
attinyx8.menu.debug.o0.build.debug=-O0
attinyx8.menu.debug.no-lto=Debug (no LTO)
attinyx8.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx8.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx8.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx8.build.extra_flags={build.debug} {build.millis} {build.neopixelport}

attinyx8opti.menu.debug.os=No Debug
attinyx8opti.menu.debug.os.build.debug=
attinyx8opti.menu.debug.og=Debug
attinyx8opti.menu.debug.og.build.debug=-Og
attinyx8opti.menu.debug.o0=Debug (no comp. optim.)
attinyx8opti.menu.debug.o0.build.debug=-O0
attinyx8opti.menu.debug.no-lto=Debug (no LTO)
attinyx8opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx8opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx8opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx8opti.build.extra_flags={build.debug} {build.millis} {build.neopixelport}

attinyx8micr.menu.debug.os=No Debug
attinyx8micr.menu.debug.os.build.debug=
attinyx8micr.menu.debug.og=Debug
attinyx8micr.menu.debug.og.build.debug=-Og
attinyx8micr.menu.debug.o0=Debug (no comp. optim.)
attinyx8micr.menu.debug.o0.build.debug=-O0
attinyx8micr.menu.debug.no-lto=Debug (no LTO)
attinyx8micr.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx8micr.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx8micr.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx8micr.build.extra_flags={build.debug} {build.millis} {build.usb} {build.neopixelport}

attinyx7.menu.debug.os=No Debug
attinyx7.menu.debug.os.build.debug=
attinyx7.menu.debug.og=Debug
attinyx7.menu.debug.og.build.debug=-Og
attinyx7.menu.debug.o0=Debug (no comp. optim.)
attinyx7.menu.debug.o0.build.debug=-O0
attinyx7.menu.debug.no-lto=Debug (no LTO)
attinyx7.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx7.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx7.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx7.build.extra_flags={build.debug} {build.millis} {build.neopixelport}

attinyx7opti.menu.debug.os=No Debug
attinyx7opti.menu.debug.os.build.debug=
attinyx7opti.menu.debug.og=Debug
attinyx7opti.menu.debug.og.build.debug=-Og
attinyx7opti.menu.debug.o0=Debug (no comp. optim.)
attinyx7opti.menu.debug.o0.build.debug=-O0
attinyx7opti.menu.debug.no-lto=Debug (no LTO)
attinyx7opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx7opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx7opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx7opti.build.extra_flags={build.debug} {build.millis} {build.neopixelport}

attinyx7micr.menu.debug.os=No Debug
attinyx7micr.menu.debug.os.build.debug=
attinyx7micr.menu.debug.og=Debug
attinyx7micr.menu.debug.og.build.debug=-Og
attinyx7micr.menu.debug.o0=Debug (no comp. optim.)
attinyx7micr.menu.debug.o0.build.debug=-O0
attinyx7micr.menu.debug.no-lto=Debug (no LTO)
attinyx7micr.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx7micr.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx7micr.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx7micr.build.extra_flags={build.debug} {build.millis} {build.usb} {build.neopixelport}

attinyx61.menu.debug.os=No Debug
attinyx61.menu.debug.os.build.debug=
attinyx61.menu.debug.og=Debug
attinyx61.menu.debug.og.build.debug=-Og
attinyx61.menu.debug.o0=Debug (no comp. optim.)
attinyx61.menu.debug.o0.build.debug=-O0
attinyx61.menu.debug.no-lto=Debug (no LTO)
attinyx61.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx61.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx61.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx61.build.extra_flags={build.debug} {build.millis} {build.pllsettings} {build.neopixelport}

attinyx61opti.menu.debug.os=No Debug
attinyx61opti.menu.debug.os.build.debug=
attinyx61opti.menu.debug.og=Debug
attinyx61opti.menu.debug.og.build.debug=-Og
attinyx61opti.menu.debug.o0=Debug (no comp. optim.)
attinyx61opti.menu.debug.o0.build.debug=-O0
attinyx61opti.menu.debug.no-lto=Debug (no LTO)
attinyx61opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx61opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx61opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx61opti.build.extra_flags={build.debug} {build.millis} {build.pllsettings} {build.neopixelport}

attinyx41.menu.debug.os=No Debug
attinyx41.menu.debug.os.build.debug=
attinyx41.menu.debug.og=Debug
attinyx41.menu.debug.og.build.debug=-Og
attinyx41.menu.debug.o0=Debug (no comp. optim.)
attinyx41.menu.debug.o0.build.debug=-O0
attinyx41.menu.debug.no-lto=Debug (no LTO)
attinyx41.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx41.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx41.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx41.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.speedfix}

attinyx41opti.menu.debug.os=No Debug
attinyx41opti.menu.debug.os.build.debug=
attinyx41opti.menu.debug.og=Debug
attinyx41opti.menu.debug.og.build.debug=-Og
attinyx41opti.menu.debug.o0=Debug (no comp. optim.)
attinyx41opti.menu.debug.o0.build.debug=-O0
attinyx41opti.menu.debug.no-lto=Debug (no LTO)
attinyx41opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx41opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx41opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx41opti.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.speedfix}

attinyx41micr.menu.debug.os=No Debug
attinyx41micr.menu.debug.os.build.debug=
attinyx41micr.menu.debug.og=Debug
attinyx41micr.menu.debug.og.build.debug=-Og
attinyx41micr.menu.debug.o0=Debug (no comp. optim.)
attinyx41micr.menu.debug.o0.build.debug=-O0
attinyx41micr.menu.debug.no-lto=Debug (no LTO)
attinyx41micr.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx41micr.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx41micr.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx41micr.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.pinmap} {build.wiremode} {build.usb} {build.speedfix}

attiny43.menu.debug.os=No Debug
attiny43.menu.debug.os.build.debug=
attiny43.menu.debug.og=Debug
attiny43.menu.debug.og.build.debug=-Og
attiny43.menu.debug.o0=Debug (no comp. optim.)
attiny43.menu.debug.o0.build.debug=-O0
attiny43.menu.debug.no-lto=Debug (no LTO)
attiny43.menu.debug.no-lto.build.debug=-Og -fno-lto
attiny43.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attiny43.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attiny43.build.extra_flags={build.debug} {build.millis} {build.neopixelport}

attiny828.menu.debug.os=No Debug
attiny828.menu.debug.os.build.debug=
attiny828.menu.debug.og=Debug
attiny828.menu.debug.og.build.debug=-Og
attiny828.menu.debug.o0=Debug (no comp. optim.)
attiny828.menu.debug.o0.build.debug=-O0
attiny828.menu.debug.no-lto=Debug (no LTO)
attiny828.menu.debug.no-lto.build.debug=-Og -fno-lto
attiny828.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attiny828.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attiny828.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.wiremode} {build.speedfix}

attiny828opti.menu.debug.os=No Debug
attiny828opti.menu.debug.os.build.debug=
attiny828opti.menu.debug.og=Debug
attiny828opti.menu.debug.og.build.debug=-Og
attiny828opti.menu.debug.o0=Debug (no comp. optim.)
attiny828opti.menu.debug.o0.build.debug=-O0
attiny828opti.menu.debug.no-lto=Debug (no LTO)
attiny828opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attiny828opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attiny828opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attiny828opti.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.wiremode} {build.speedfix}

