felias-fogg/dw-link/core-mods/ATTinyCore-mods/boards.txt
attiny1634.menu.debug.os=No Debug
attiny1634.menu.debug.os.build.debug=
attiny1634.menu.debug.og=Debug
attiny1634.menu.debug.og.build.debug=-Og
attiny1634.menu.debug.o0=Debug (no comp. optim.)
attiny1634.menu.debug.o0.build.debug=-O0
attiny1634.menu.debug.no-lto=Debug (no LTO)
attiny1634.menu.debug.no-lto.build.debug=-Og -fno-lto
attiny1634.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attiny1634.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attiny1634.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.speedfix}

attiny1634opti.menu.debug.os=No Debug
attiny1634opti.menu.debug.os.build.debug=
attiny1634opti.menu.debug.og=Debug
attiny1634opti.menu.debug.og.build.debug=-Og
attiny1634opti.menu.debug.o0=Debug (no comp. optim.)
attiny1634opti.menu.debug.o0.build.debug=-O0
attiny1634opti.menu.debug.no-lto=Debug (no LTO)
attiny1634opti.menu.debug.no-lto.build.debug=-Og -fno-lto
attiny1634opti.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attiny1634opti.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attiny1634opti.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.speedfix}

attinyx313.menu.debug.os=No Debug
attinyx313.menu.debug.os.build.debug=
attinyx313.menu.debug.og=Debug
attinyx313.menu.debug.og.build.debug=-Og
attinyx313.menu.debug.o0=Debug (no comp. optim.)
attinyx313.menu.debug.o0.build.debug=-O0
attinyx313.menu.debug.no-lto=Debug (no LTO)
attinyx313.menu.debug.no-lto.build.debug=-Og -fno-lto
attinyx313.menu.debug.no-ltoo0=Debug (no LTO, no comp. optim.)
attinyx313.menu.debug.no-ltoo0.build.debug=-O0 -fno-lto
attinyx313.build.extra_flags={build.debug} {build.millis} {build.neopixelport} {build.initsectimer}
